date
Tue Sep 28 22:46:03 2021
set_host_options -max_cores 8
1
set compile_seqmap_propagate_constants     false
false
set compile_seqmap_propagate_high_effort   false
false
set compile_enable_register_merging        false
false
set write_sdc_output_net_resistance        false
false
set timing_separate_clock_gating_group     true
true
set verilogout_no_tri tru
tru
set html_log_enable true
true
set design       [getenv "DESIGN"]
Warning: HTML log file will be overwritten: '/home/home2/students/esmailid/template/synth/default.html'
        If this is not desired then please use the following variable to rename the HTML file: html_log_filename (DCSH-019)
Error: can't read "::env(DESIGN)": no such variable
        Use error_info for more info. (CMD-013)
set clkname      [getenv "CLKNAME"]
Error: can't read "::env(CLKNAME)": no such variable
        Use error_info for more info. (CMD-013)
set clkperiod    [getenv "CLK_PERIOD"]
Error: can't read "::env(CLK_PERIOD)": no such variable
        Use error_info for more info. (CMD-013)
set target_lib   [getenv "SYNTH_LIBRARY"]
Error: can't read "::env(SYNTH_LIBRARY)": no such variable
        Use error_info for more info. (CMD-013)
set tech         [getenv "TECH"]
Error: can't read "::env(TECH)": no such variable
        Use error_info for more info. (CMD-013)
set work_dir     ${design}_synth_${tech}_${clkperiod}ps
Error: can't read "design": no such variable
        Use error_info for more info. (CMD-013)
#if {[file exist $work_dir]} {
#sh rm -rf $work_dir
#}
sh mkdir -p $work_dir/reports
Error: can't read "work_dir": no such variable
        Use error_info for more info. (CMD-013)
sh mkdir -p $work_dir/netlist
Error: can't read "work_dir": no such variable
        Use error_info for more info. (CMD-013)
set search_path [concat * $search_path]
* . /opt/synopsys/syn/P-2019.03-SP1-1/libraries/syn /opt/synopsys/syn/P-2019.03-SP1-1/dw/syn_ver /opt/synopsys/syn/P-2019.03-SP1-1/dw/sim_ver
sh rm -rf ./work
define_design_lib WORK -path ./work
1
set_svf $design.svf
Error: can't read "design": no such variable
        Use error_info for more info. (CMD-013)
set target_library $target_lib
Error: can't read "target_lib": no such variable
        Use error_info for more info. (CMD-013)
set link_library $target_lib
Error: can't read "target_lib": no such variable
        Use error_info for more info. (CMD-013)
#source -echo -verbose ../../../../../memlib/link_mem.tcl
if {[file exist ./set_design.tcl]} {
  source ./set_design.tcl
} else {
  source -echo -verbose ./analyze.tcl
}
analyze -library WORK -format verilog ../rtl/jscL_Nulla.v;
Running PRESTO HDLC
Compiling source file ../rtl/jscL_Nulla.v
Presto compilation completed successfully.
Warning: Can't read link_library file 'your_library.db'. (UID-3)
1
analyze -library WORK -format verilog ../rtl/kernel_1.v;
Running PRESTO HDLC
Compiling source file ../rtl/kernel_1.v
Presto compilation completed successfully.
Warning: Can't read link_library file 'your_library.db'. (UID-3)
1
analyze -library WORK -format verilog ../rtl/kernel_2.v;
Running PRESTO HDLC
Compiling source file ../rtl/kernel_2.v
Presto compilation completed successfully.
Warning: Can't read link_library file 'your_library.db'. (UID-3)
1
analyze -library WORK -format verilog ../rtl/kernel_3.v;
Running PRESTO HDLC
Compiling source file ../rtl/kernel_3.v
Presto compilation completed successfully.
Warning: Can't read link_library file 'your_library.db'. (UID-3)
1
analyze -library WORK -format verilog ../rtl/kernel_4.v;
Running PRESTO HDLC
Compiling source file ../rtl/kernel_4.v
Presto compilation completed successfully.
Warning: Can't read link_library file 'your_library.db'. (UID-3)
1
analyze -library WORK -format verilog ../rtl/kernel_5.v;
Running PRESTO HDLC
Compiling source file ../rtl/kernel_5.v
Presto compilation completed successfully.
Warning: Can't read link_library file 'your_library.db'. (UID-3)
1
analyze -library WORK -format verilog ../rtl/kernel_6.v;
Running PRESTO HDLC
Compiling source file ../rtl/kernel_6.v
Presto compilation completed successfully.
Warning: Can't read link_library file 'your_library.db'. (UID-3)
1
1
elaborate $design
Error: can't read "design": no such variable
        Use error_info for more info. (CMD-013)
date
Tue Sep 28 22:46:18 2021
link
Error: Current design is not defined. (UID-4)
0
set_max_area 0
Error: Current design is not defined. (UID-4)
0
set_clock_gating_style -sequential_cell latch -positive_edge_logic {nand} -negative_edge_logic {nor} -minimum_bitwidth 5 -max_fanout 64
Error: Cannot read file 'your_library.db'. (UID-58)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: There is no "NAND" gate in the target library. (PWR-122)
Error: There is no "NOR" gate in the target library. (PWR-122)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Warning: A latch-based clock-gating style was chosen but
        no latches are in the technology library. (PWR-661)
Warning: The clock-gating style was not changed. (PWR-132)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
0
source -echo -verbose ./constraints.tcl
create_clock $clkname  -name CLK  -period $clkperiod
Error: can't read "clkname": no such variable
        Use error_info for more info. (CMD-013)
#set_multicycle_path -setup 2 -from I2/Z_S_reg* -to I2/Z_S_reg*
#set_multicycle_path -hold  1 -from I2/Z_S_reg* -to I2/Z_S_reg*
#set_multicycle_path -setup 2 -from I1/Z_S_reg* -to I2/Z_S_reg*
#set_multicycle_path -hold  1 -from I1/Z_S_reg* -to I2/Z_S_reg*
#set_multicycle_path -setup 2 -from I1/Z_C_reg* -to I2/Z_S_reg*
#set_multicycle_path -hold  1 -from I1/Z_C_reg* -to I2/Z_S_reg*
#set_multicycle_path -setup 2 -from I1/C_reg*   -to I2/Z_S_reg*
#set_multicycle_path -hold  1 -from I1/C_reg*   -to I2/Z_S_reg*
#set_multicycle_path -setup 2 -from M_reg* -to I2/Z_S_reg*
#set_multicycle_path -hold  1 -from M_reg* -to I2/Z_S_reg*
set input_ports  [remove_from_collection [all_inputs] $clkname]
Error: Current design is not defined. (UID-4)
Error: can't read "clkname": no such variable
        Use error_info for more info. (CMD-013)
set output_ports [all_outputs]
Error: Current design is not defined. (UID-4)
#############################################################################################
#set_input_delay  -max [expr $clkperiod/4]   [get_ports $input_ports ]  -clock CLK
#set_input_delay  -min 0   [get_ports $input_ports ]  -clock CLK
#set_output_delay -max [expr $clkperiod/4]   [get_ports $output_ports ] -clock CLK
#set_output_delay -min 0.5            [get_ports $output_ports ] -clock CLK
#############################################################################################
##  set_input_transition -max 0.5 [get_ports $input_ports]
##  set_input_transition -min 0   [get_ports $input_ports]
##  set_load -max .001   [get_ports $output_ports]
##  set_load -min .0005  [get_ports $output_ports]
group_path -name output_group -to   [all_outputs]
Error: Current design is not defined. (UID-4)
Error: Value for list '-to' must have 1 elements. (CMD-036)
0
group_path -name input_group  -from [all_inputs]
Error: Current design is not defined. (UID-4)
Error: Value for list '-from' must have 1 elements. (CMD-036)
0
#set_max_delay [expr $clkperiod/2] -from [all_inputs] -to [all_outputs] -group_path "io_group"
infer_switching_activity -apply
0
set_switching_activity [get_ports $input_ports]  -static_probability 0.5 -toggle_rate .1 -base_clock CLK
Error: can't read "input_ports": no such variable
        Use error_info for more info. (CMD-013)
group_path -name output_group -to   [all_outputs]
Error: Current design is not defined. (UID-4)
Error: Value for list '-to' must have 1 elements. (CMD-036)
0
group_path -name input_group  -from [all_inputs]
Error: Current design is not defined. (UID-4)
Error: Value for list '-from' must have 1 elements. (CMD-036)
0
date
Tue Sep 28 22:46:18 2021
mem -all -verbose
Main process mem-peak:    110 Mb
No child process

113604
compile_ultra -no_autoungroup -no_seq_output_inversion -no_boundary_optimization -gate_clock -area_high_effort_script
Warning: The value of variable 'compile_preserve_subdesign_interfaces' has been changed to true because '-no_boundary_optimization' is used. (OPT-133)
Information: Starting from 2013.12 release, constant propagation is enabled even when boundary optimization is disabled. (OPT-1318)
Error: Current design is not defined. (UID-4)
0
report_area
Error: Current design is not defined. (UID-4)
0
date
Tue Sep 28 22:46:18 2021
mem -all -verbose
Main process mem-peak:    110 Mb
No child process

113604
optimize_netlist -area
Error: Current design is not defined. (UID-4)
0
report_area
Error: Current design is not defined. (UID-4)
0
date
Tue Sep 28 22:46:18 2021
mem -all -verbose
Main process mem-peak:    110 Mb
No child process

113604
compile_ultra -no_autoungroup -no_seq_output_inversion -no_boundary_optimization -incremental
Warning: The value of variable 'compile_preserve_subdesign_interfaces' has been changed to true because '-no_boundary_optimization' is used. (OPT-133)
Information: Starting from 2013.12 release, constant propagation is enabled even when boundary optimization is disabled. (OPT-1318)
Error: Current design is not defined. (UID-4)
0
date
Tue Sep 28 22:46:18 2021
mem -all -verbose
Main process mem-peak:    110 Mb
No child process

113604
change_names -hier -rule verilog
Error: Current design is not defined. (UID-4)
0
write_file -hierarchy -format verilog -output "$work_dir/netlist/$design.v"
Error: can't read "work_dir": no such variable
        Use error_info for more info. (CMD-013)
write_sdc "$work_dir/netlist/$design.sdc"
Error: can't read "work_dir": no such variable
        Use error_info for more info. (CMD-013)
report_timing -delay max  -nosplit -input -nets -cap -max_path 10 -nworst 10    > ./$work_dir/reports/report_timing_max.rpt
Error: can't read "work_dir": no such variable
        Use error_info for more info. (CMD-013)
report_timing -delay min  -nosplit -input -nets -cap -max_path 10 -nworst 10    > ./$work_dir/reports/report_timing_min.rpt
Error: can't read "work_dir": no such variable
        Use error_info for more info. (CMD-013)
report_constraint -all_violators -verbose  -nosplit                             > ./$work_dir/reports/report_constraint.rpt
Error: can't read "work_dir": no such variable
        Use error_info for more info. (CMD-013)
check_design -nosplit                                                           > ./$work_dir/reports/check_design.rpt
Error: can't read "work_dir": no such variable
        Use error_info for more info. (CMD-013)
report_design                                                                   > ./$work_dir/reports/report_design.rpt
Error: can't read "work_dir": no such variable
        Use error_info for more info. (CMD-013)
report_area                                                                     > ./$work_dir/reports/report_area.rpt
Error: can't read "work_dir": no such variable
        Use error_info for more info. (CMD-013)
report_timing -loop                                                             > ./$work_dir/reports/timing_loop.rpt
Error: can't read "work_dir": no such variable
        Use error_info for more info. (CMD-013)
report_power -hierarchy -analysis_effort high                                   > ./$work_dir/reports/report_power.rpt
Error: can't read "work_dir": no such variable
        Use error_info for more info. (CMD-013)
report_qor                                                                      > ./$work_dir/reports/report_qor.rpt
Error: can't read "work_dir": no such variable
        Use error_info for more info. (CMD-013)
report_area -hierarchy -nosplit                                                 > ./$work_dir/reports/report_area_hier.rpt
Error: can't read "work_dir": no such variable
        Use error_info for more info. (CMD-013)
ungroup -all -flatten
Error: Current design is not defined. (UID-4)
0
write_file -hierarchy -format verilog -output "$work_dir/netlist/${design}_flat.v"
Error: can't read "work_dir": no such variable
        Use error_info for more info. (CMD-013)
date
Tue Sep 28 22:46:18 2021
exit

Thank you...

