date
Thu Sep 30 19:14:46 2021
set_host_options -max_cores 8
Warning: You requested 8 cores. However, load on host sahand is 55.79. Tool will ignore the request and use 1 cores. (UIO-231)
1
set compile_seqmap_propagate_constants     false
false
set compile_seqmap_propagate_high_effort   false
false
set compile_enable_register_merging        false
false
set write_sdc_output_net_resistance        false
false
set timing_separate_clock_gating_group     true
true
set verilogout_no_tri tru
tru
set html_log_enable true
Warning: HTML log file will be overwritten: '/home/home2/students/esmailid/template_1_DC/synth/default.html'
        If this is not desired then please use the following variable to rename the HTML file: html_log_filename (DCSH-019)
true
set design       [getenv "DESIGN"]
jsc_Nulla
set clkname      [getenv "CLKNAME"]
clk
set clkperiod    [getenv "CLK_PERIOD"]
1002
set target_lib   [getenv "SYNTH_LIBRARY"]
/home/home2/students/esmailid/NCSU-FreePDK45-1.4/FreePDK45/osu_soc/lib/source/signalstorm/files/gscl45nm.db
set tech         [getenv "TECH"]
45nm
set work_dir     ${design}_synth_${tech}_${clkperiod}ps
jsc_Nulla_synth_45nm_1002ps
#if {[file exist $work_dir]} {
#sh rm -rf $work_dir
#}
sh mkdir -p $work_dir/reports
sh mkdir -p $work_dir/netlist
set search_path [concat * $search_path]
* . /opt/synopsys/syn/P-2019.03-SP1-1/libraries/syn /opt/synopsys/syn/P-2019.03-SP1-1/dw/syn_ver /opt/synopsys/syn/P-2019.03-SP1-1/dw/sim_ver
sh rm -rf ./work
define_design_lib WORK -path ./work
1
set_svf $design.svf
1
set target_library $target_lib
/home/home2/students/esmailid/NCSU-FreePDK45-1.4/FreePDK45/osu_soc/lib/source/signalstorm/files/gscl45nm.db
set link_library $target_lib
/home/home2/students/esmailid/NCSU-FreePDK45-1.4/FreePDK45/osu_soc/lib/source/signalstorm/files/gscl45nm.db
#source -echo -verbose ../../../../../memlib/link_mem.tcl
if {[file exist ./set_design.tcl]} {
  source ./set_design.tcl
} else {
  source -echo -verbose ./analyze.tcl
}
analyze -library WORK -format verilog ../rtl/kernel_1.v;
Running PRESTO HDLC
Compiling source file ../rtl/kernel_1.v
Presto compilation completed successfully.
Loading db file '/home/home2/students/esmailid/NCSU-FreePDK45-1.4/FreePDK45/osu_soc/lib/source/signalstorm/files/gscl45nm.db'
1
analyze -library WORK -format verilog ../rtl/kernel_2.v;
Running PRESTO HDLC
Compiling source file ../rtl/kernel_2.v
Presto compilation completed successfully.
1
analyze -library WORK -format verilog ../rtl/kernel_3.v;
Running PRESTO HDLC
Compiling source file ../rtl/kernel_3.v
Presto compilation completed successfully.
1
analyze -library WORK -format verilog ../rtl/kernel_4.v;
Running PRESTO HDLC
Compiling source file ../rtl/kernel_4.v
Presto compilation completed successfully.
1
analyze -library WORK -format verilog ../rtl/kernel_5.v;
Running PRESTO HDLC
Compiling source file ../rtl/kernel_5.v
Presto compilation completed successfully.
1
analyze -library WORK -format verilog ../rtl/kernel_6.v;
Running PRESTO HDLC
Compiling source file ../rtl/kernel_6.v
Presto compilation completed successfully.
1
analyze -library WORK -format verilog ../rtl/jscL_Nulla.v;
Running PRESTO HDLC
Compiling source file ../rtl/jscL_Nulla.v
Presto compilation completed successfully.
1
1
elaborate $design
Loading db file '/opt/synopsys/syn/P-2019.03-SP1-1/libraries/syn/gtech.db'
Loading db file '/opt/synopsys/syn/P-2019.03-SP1-1/libraries/syn/standard.sldb'
  Loading link library 'gscl45nm'
  Loading link library 'gtech'
Error: Cannot find the design 'jsc_Nulla' in the library 'WORK'. (LBR-0)
0
date
Thu Sep 30 19:15:01 2021
link
Error: Current design is not defined. (UID-4)
0
set_max_area 0
Error: Current design is not defined. (UID-4)
0
set_clock_gating_style -sequential_cell latch -positive_edge_logic {nand} -negative_edge_logic {nor} -minimum_bitwidth 5 -max_fanout 64

Current clock gating style....
Sequential cell: latch
Minimum bank bitwidth: 5
Minimum bank bitwidth for enhanced clock gating: 10
Maximum fanout: 64
Setup time for clock gate: 0.000000
Hold time for clock gate: 0.000000
Clock gating circuitry (positive edge): nand
 Note: inverter between clock gating circuitry 
       and (positive edge) register clock pin.
Clock gating circuitry (negative edge): nor
Control point insertion: none
Control signal for control point: scan_enable
Observation point insertion: false
Observation logic depth: 5
1
source -echo -verbose ./constraints.tcl
create_clock $clkname  -name CLK  -period $clkperiod
Error: Current design is not defined. (UID-4)
Error: Can't find object 'clk'. (UID-109)
Error: Value for list 'source_objects' must have 1 elements. (CMD-036)
0
#set_multicycle_path -setup 2 -from I2/Z_S_reg* -to I2/Z_S_reg*
#set_multicycle_path -hold  1 -from I2/Z_S_reg* -to I2/Z_S_reg*
#set_multicycle_path -setup 2 -from I1/Z_S_reg* -to I2/Z_S_reg*
#set_multicycle_path -hold  1 -from I1/Z_S_reg* -to I2/Z_S_reg*
#set_multicycle_path -setup 2 -from I1/Z_C_reg* -to I2/Z_S_reg*
#set_multicycle_path -hold  1 -from I1/Z_C_reg* -to I2/Z_S_reg*
#set_multicycle_path -setup 2 -from I1/C_reg*   -to I2/Z_S_reg*
#set_multicycle_path -hold  1 -from I1/C_reg*   -to I2/Z_S_reg*
#set_multicycle_path -setup 2 -from M_reg* -to I2/Z_S_reg*
#set_multicycle_path -hold  1 -from M_reg* -to I2/Z_S_reg*
set input_ports  [remove_from_collection [all_inputs] $clkname]
Error: Current design is not defined. (UID-4)
set output_ports [all_outputs]
Error: Current design is not defined. (UID-4)
#############################################################################################
#set_input_delay  -max [expr $clkperiod/4]   [get_ports $input_ports ]  -clock CLK
#set_input_delay  -min 0   [get_ports $input_ports ]  -clock CLK
#set_output_delay -max [expr $clkperiod/4]   [get_ports $output_ports ] -clock CLK
#set_output_delay -min 0.5            [get_ports $output_ports ] -clock CLK
#############################################################################################
##  set_input_transition -max 0.5 [get_ports $input_ports]
##  set_input_transition -min 0   [get_ports $input_ports]
##  set_load -max .001   [get_ports $output_ports]
##  set_load -min .0005  [get_ports $output_ports]
group_path -name output_group -to   [all_outputs]
Error: Current design is not defined. (UID-4)
Error: Value for list '-to' must have 1 elements. (CMD-036)
0
group_path -name input_group  -from [all_inputs]
Error: Current design is not defined. (UID-4)
Error: Value for list '-from' must have 1 elements. (CMD-036)
0
#set_max_delay [expr $clkperiod/2] -from [all_inputs] -to [all_outputs] -group_path "io_group"
infer_switching_activity -apply
0
set_switching_activity [get_ports $input_ports]  -static_probability 0.5 -toggle_rate .1 -base_clock CLK
Error: Value for list '<object_list>' must have 1 elements. (CMD-036)
0
0
group_path -name output_group -to   [all_outputs]
Error: Current design is not defined. (UID-4)
Error: Value for list '-to' must have 1 elements. (CMD-036)
0
group_path -name input_group  -from [all_inputs]
Error: Current design is not defined. (UID-4)
Error: Value for list '-from' must have 1 elements. (CMD-036)
0
date
Thu Sep 30 19:15:01 2021
mem -all -verbose
Main process mem-peak:    109 Mb
No child process

112548
compile_ultra -no_autoungroup -no_seq_output_inversion -no_boundary_optimization -gate_clock -area_high_effort_script
Warning: The value of variable 'compile_preserve_subdesign_interfaces' has been changed to true because '-no_boundary_optimization' is used. (OPT-133)
Information: Starting from 2013.12 release, constant propagation is enabled even when boundary optimization is disabled. (OPT-1318)
Error: Current design is not defined. (UID-4)
0
report_area
Error: Current design is not defined. (UID-4)
0
date
Thu Sep 30 19:15:01 2021
mem -all -verbose
Main process mem-peak:    109 Mb
No child process

112548
optimize_netlist -area
Error: Current design is not defined. (UID-4)
0
report_area
Error: Current design is not defined. (UID-4)
0
date
Thu Sep 30 19:15:01 2021
mem -all -verbose
Main process mem-peak:    109 Mb
No child process

112548
compile_ultra -no_autoungroup -no_seq_output_inversion -no_boundary_optimization -incremental
Warning: The value of variable 'compile_preserve_subdesign_interfaces' has been changed to true because '-no_boundary_optimization' is used. (OPT-133)
Information: Starting from 2013.12 release, constant propagation is enabled even when boundary optimization is disabled. (OPT-1318)
Error: Current design is not defined. (UID-4)
0
date
Thu Sep 30 19:15:01 2021
mem -all -verbose
Main process mem-peak:    109 Mb
No child process

112548
change_names -hier -rule verilog
Error: Current design is not defined. (UID-4)
0
write_file -hierarchy -format verilog -output "$work_dir/netlist/$design.v"
Error: No files or designs were specified. (UID-22)
0
write_sdc "$work_dir/netlist/$design.sdc"
Error: Current design is not defined. (UID-4)
0
report_timing -delay max  -nosplit -input -nets -cap -max_path 10 -nworst 10    > ./$work_dir/reports/report_timing_max.rpt
report_timing -delay min  -nosplit -input -nets -cap -max_path 10 -nworst 10    > ./$work_dir/reports/report_timing_min.rpt
report_constraint -all_violators -verbose  -nosplit                             > ./$work_dir/reports/report_constraint.rpt
check_design -nosplit                                                           > ./$work_dir/reports/check_design.rpt
report_design                                                                   > ./$work_dir/reports/report_design.rpt
report_area                                                                     > ./$work_dir/reports/report_area.rpt
report_timing -loop                                                             > ./$work_dir/reports/timing_loop.rpt
report_power -hierarchy -analysis_effort high                                   > ./$work_dir/reports/report_power.rpt
report_qor                                                                      > ./$work_dir/reports/report_qor.rpt
report_area -hierarchy -nosplit                                                 > ./$work_dir/reports/report_area_hier.rpt
ungroup -all -flatten
Error: Current design is not defined. (UID-4)
0
write_file -hierarchy -format verilog -output "$work_dir/netlist/${design}_flat.v"
Error: No files or designs were specified. (UID-22)
0
date
Thu Sep 30 19:15:01 2021
exit

Thank you...

